app/Controllers/Course.php

    public function index(): string
    {
        $courseCategoryModel = new CourseCategoryModel();
        $courseModel = new CourseModel();

        $data['category'] = $courseCategoryModel->orderBy('date', 'desc')->findAll();
        $data['course'] = $courseModel->orderBy('date', 'desc')->findAll();
---
SELECT *
FROM `category`
ORDER BY `date` DESC
SELECT *
FROM `course`
ORDER BY `date` DESC

    public function courseByCategory($id = false)
    {
        $courseCategoryModel = new CourseCategoryModel();
        $courseModel = new CourseModel();

        $data['category'] = $courseCategoryModel->findAll();
        $data['course'] = $courseModel->where('cat_id', $id)->findAll();
---
SELECT *
FROM `category`
SELECT *
FROM `course`
WHERE `cat_id` = '11'

    public function courseBySingle($id = false)
    {
        $courseCategoryModel = new CourseCategoryModel();
        $courseModel = new CourseModel();

        $data['category'] = $courseCategoryModel->findAll();
        $data['courseSingle'] = $courseModel->where('co_id', $id)->first();
        $data['course'] = $courseModel->orderBy('date', 'desc')->findAll();
        $catID = $data['courseSingle']['cat_id'];
        $data['related'] = $courseModel->where('cat_id', $catID)->orderBy('date', 'desc')->findAll();
---
SELECT *
FROM `category`
SELECT *
FROM `course`
WHERE `co_id` = '5'
 LIMIT 1
SELECT *
FROM `course`
ORDER BY `date` DESC
SELECT *
FROM `course`
WHERE `cat_id` = '11'
ORDER BY `date` DESC

    public function fetchCourse()
    {
        $course = $this->request->getPost('course');
        $category = $this->request->getPost('category');

        $courseModel = new CourseModel();

        $data = ['cat_id' => $category, 'course' => $course];
        $courses = $courseModel->like($data)->orderBy('date', 'desc')->findAll();
---
SELECT *
FROM `course`
WHERE `cat_id` LIKE '%%' ESCAPE '!'
AND  `course` LIKE '%%' ESCAPE '!'
ORDER BY `date` DESC