app/Controllers/Home.php

    public function index(): string
    {
        $eventModel = new EventModel();
        $teamModel = new TeamModel();
        $courseCategoryModel = new CourseCategoryModel();
        $courseModel = new CourseModel();

        $data['category'] = $courseCategoryModel->where('status', true)->findAll();
        $data['course'] = $courseModel->findAll();
        $data['event'] = $eventModel->findAll();
        $data['team'] = $teamModel->findAll();
---
SELECT *
FROM `category`
WHERE `status` = 1
SELECT *
FROM `course`
SELECT *
FROM `event`
SELECT *
FROM `team`